{
  "description": "This document is intended as a template for an incident response runbook in [Incident Manager](https://docs.aws.amazon.com/incident-manager/latest/userguide/index.html).\n\nFor optimal use, create your own automation document by copying the contents of this runbook template and customizing it for your scenario. Then, navigate to your [Response Plan](https://console.aws.amazon.com/systems-manager/incidents/response-plans/home) and associate it with your new automation document; your runbook is automatically started when an incident is created with the associated response plan. For more information, see [Incident Manager - Runbooks](https://docs.aws.amazon.com/incident-manager/latest/userguide/runbooks.html). \u000b\n\nSuggested customizations include:\n* Updating the text in each step to provide specific guidance and instructions, such as commands to run or links to relevant dashboards\n* Automating actions before triage or diagnosis to gather additional telemetry or diagnostics using aws:executeAwsApi\n* Automating actions in mitigation using aws:executeAutomation, aws:executeScript, or aws:invokeLambdaFunction\n",
  "schemaVersion": "0.3",
  "mainSteps": [
    {
      "name": "Triage",
      "action": "aws:pause",
      "inputs": {},
      "description": "**Determine customer impact**\n\n* View the **Metrics** tab of the incident or navigate to your [CloudWatch Dashboards](https://console.aws.amazon.com/cloudwatch/home#dashboards:) to find key performance indicators (KPIs) that show the extent of customer impact. \n* Use [CloudWatch Synthetics](https://console.aws.amazon.com/cloudwatch/home#synthetics:) and [Contributor Insights](https://console.aws.amazon.com/cloudwatch/home#contributorinsights:) to identify real-time failures in customer workflows. \n\n**Communicate customer impact**\n\nUpdate the following fields to accurately describe the incident:\n* **Title** - The title should be quickly recognizable by the team and specific to the particular incident.\n* **Summary** - The summary should contain the most important and up-to-date information to quickly onboard new responders to the incident.\n* **Impact** - Select one of the following impact ratings to describe the incident:\n  * 1 – Critical impact, full application failure that impacts many to all customers.\n  * 2 – High impact, partial application failure with impact to many customers.\n  * 3 – Medium impact, the application is providing reduced service to many customers.\n  * 4 – Low impact, the application is providing reduced service to few customers.\n  * 5 – No impact, customers are not currently impacted but urgent action is needed to avoid impact."
    },
    {
      "name": "Diagnosis",
      "action": "aws:pause",
      "inputs": {},
      "description": "**Rollback**  \n\n* Look for recent changes to the production environment that might have caused the incident. Engage the responsible team using the **Contacts** tab of the incident.\n* Rollback these changes if possible.\n\n**Locate failures**  \n* Review metrics and alarms related to your [Application](https://console.aws.amazon.com/systems-manager/appmanager/applications). Add any related metrics and alarms to the **Metrics** tab of the incident.\n* Use [CloudWatch ServiceLens](https://console.aws.amazon.com/cloudwatch/home#servicelens:) to troubleshoot issues across multiple services.\n* Investigate the possibility of ongoing incidents across your organization. Check for known incidents and issues in AWS using [Personal Health Dashboard](https://console.aws.amazon.com/systems-manager/insights). Add related links to the **Related Items** tab of the incident. \n* Avoid going too deep in diagnosing the failure and focus on how to mitigate the customer impact. Update the **Timeline** tab of the incident when a possible diagnosis is identified. \n"
    },
    {
      "name": "Mitigation",
      "action": "aws:pause",
      "description": "**Collaborate**  \n* Communicate any changes or important information from the previous step to the members of the associated chat channel for this incident. Ask for input on possible ways to mitigate customer impact.\n* Engage additional contacts or teams using their escalation plan from the **Contacts** tab.\n* If necessary, prepare an emergency change request in [Change Manager](https://console.aws.amazon.com/systems-manager/change-manager).\n\n**Implement mitigation**  \n* Consider re-routing customer traffic or throttling incoming requests to reduce customer impact. \n* Look for common runbooks in [Automation](https://console.aws.amazon.com/systems-manager/automation) or run commands using [Run Command](https://.console.aws.amazon.com/systems-manager/run-command).\n* Update the **Timeline** tab of the incident when a possible mitigation is identified. If needed, review the mitigation with others in the associated chat channel before proceeding.  ",
      "inputs": {}
    },
    {
      "name": "Recovery",
      "action": "aws:pause",
      "inputs": {},
      "description": "**Monitor customer impact**\n* View the **Metrics** tab of the incident to monitor for recovery of your key performance indicators (KPIs).\n* Update the **Impact** field in the incident when customer impact has been reduced or resolved. \n\n**Identify action items**  \n* Add entries in the **Timeline** tab of the incident to record key decisions and actions taken, including temporary mitigations that might have been implemented. \n* Create a **Post-Incident Analysis** when the incident is closed in order to identify and track action items in [OpsCenter](https://console.aws.amazon.com/systems-manager/opsitems). "
    }
  ]
}
